[Killed] ConditionalExpression
src/core/coverage/calculator.ts:4:7
 import { CoverageInfo, FileCoverageInfo, LcovSection } from './types.js';
 
 export const calculateOverallCoverage = (sections: LcovSection[]): CoverageInfo => {
-  if (sections.length === 0) {
+  if (true) {
     return {
       linesCoveragePercentage: 0,
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%; Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: expected +0 to be 100 // Object.is equality

[Killed] EqualityOperator
src/core/coverage/calculator.ts:4:7
 import { CoverageInfo, FileCoverageInfo, LcovSection } from './types.js';
 
 export const calculateOverallCoverage = (sections: LcovSection[]): CoverageInfo => {
-  if (sections.length === 0) {
+  if (sections.length !== 0) {
     return {
       linesCoveragePercentage: 0,
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact; coverage_summary tool when all lines in 2 files are covered, then returns 100%
statusReason: expected { linesPercentageImpact: +0, …(1) } to match object { linesPercentageImpact: 50, …(1) }

[Killed] BlockStatement
src/core/coverage/calculator.ts:14:35
   let instrumented = 0;
   let hit = 0;
 
-  for (const section of sections) {
-    instrumented += section.lines.instrumented;
-    hit += section.lines.hit;
-  }
+  for (const section of sections) {}
 
   if (instrumented === 0) {
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact; coverage_summary tool when all lines in 2 files are covered, then returns 100%
statusReason: expected { linesPercentageImpact: +0, …(1) } to match object { linesPercentageImpact: 50, …(1) }

[Killed] AssignmentOperator
src/core/coverage/calculator.ts:15:5
   let hit = 0;
 
   for (const section of sections) {
-    instrumented += section.lines.instrumented;
+    instrumented -= section.lines.instrumented;
     hit += section.lines.hit;
   }
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%; Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: expected -100 to be 100 // Object.is equality

[Killed] AssignmentOperator
src/core/coverage/calculator.ts:16:5
 
   for (const section of sections) {
     instrumented += section.lines.instrumented;
-    hit += section.lines.hit;
+    hit -= section.lines.hit;
   }
 
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%; Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: expected -100 to be 100 // Object.is equality

[Killed] BlockStatement
src/core/coverage/calculator.ts:19:27
     hit += section.lines.hit;
   }
 
-  if (instrumented === 0) {
-    return {
-      linesCoveragePercentage: 0,
-      branchesCoveragePercentage: 0
-    };
-  }
+  if (instrumented === 0) {}
 
   const percentage = (hit / instrumented) * 100;
killedBy: coverage_summary tool when file has no lines, then returns 0%
statusReason: expected null to be +0 // Object.is equality

[Killed] ConditionalExpression
src/core/coverage/calculator.ts:19:7
     hit += section.lines.hit;
   }
 
-  if (instrumented === 0) {
+  if (false) {
     return {
       linesCoveragePercentage: 0,
killedBy: coverage_summary tool when file has no lines, then returns 0%
statusReason: expected null to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/core/coverage/calculator.ts:26:22
     };
   }
 
-  const percentage = (hit / instrumented) * 100;
+  const percentage = hit / instrumented / 100;
   const branchesCoveragePercentage = extractBranchCoverage(sections);
 
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%; Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: expected +0 to be 100 // Object.is equality

[Killed] ArithmeticOperator
src/core/coverage/calculator.ts:30:30
   const branchesCoveragePercentage = extractBranchCoverage(sections);
 
   return {
-    linesCoveragePercentage: Math.round(percentage * 10) / 10,
+    linesCoveragePercentage: Math.round(percentage * 10) * 10,
     branchesCoveragePercentage
   };
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact; coverage_summary tool when all lines in 2 files are covered, then returns 100%
statusReason: expected { linesPercentageImpact: 5000, …(1) } to match object { linesPercentageImpact: 50, …(1) }

[Killed] ConditionalExpression
src/core/coverage/calculator.ts:36:38
 };
 
 export const calculateFileCoverage = (sections: LcovSection[], filePath: string): FileCoverageInfo => {
-  const section = sections.find(s => s.path === filePath);
+  const section = sections.find(s => false);
 
   if (!section) {
killedBy: coverage_file_summary tool when all lines in file are covered, then returns 100%
statusReason: expected { path: 'src/main.ts', …(2) } to match object { path: 'src/main.ts', …(1) }
(1 matching property omitted from actual)

[Killed] EqualityOperator
src/core/coverage/calculator.ts:36:38
 };
 
 export const calculateFileCoverage = (sections: LcovSection[], filePath: string): FileCoverageInfo => {
-  const section = sections.find(s => s.path === filePath);
+  const section = sections.find(s => s.path !== filePath);
 
   if (!section) {
killedBy: coverage_file_summary tool when all lines in file are covered, then returns 100%
statusReason: expected { path: 'src/main.ts', …(2) } to match object { path: 'src/main.ts', …(1) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/core/coverage/calculator.ts:38:17
 export const calculateFileCoverage = (sections: LcovSection[], filePath: string): FileCoverageInfo => {
   const section = sections.find(s => s.path === filePath);
 
-  if (!section) {
-    return {
-      path: filePath,
-      linesCoveragePercentage: 0,
-      branchesCoveragePercentage: 0
-    };
-  }
+  if (!section) {}
 
   if (section.lines.instrumented === 0) {
killedBy: coverage_file_summary tool when file not found in lcov, then returns 0% coverage
statusReason: {"message":"Cannot read properties of undefined (reading 'lines')"}

[Killed] ConditionalExpression
src/core/coverage/calculator.ts:38:7
 export const calculateFileCoverage = (sections: LcovSection[], filePath: string): FileCoverageInfo => {
   const section = sections.find(s => s.path === filePath);
 
-  if (!section) {
+  if (false) {
     return {
       path: filePath,
killedBy: coverage_file_summary tool when file not found in lcov, then returns 0% coverage
statusReason: {"message":"Cannot read properties of undefined (reading 'lines')"}

[Survived] ConditionalExpression
src/core/coverage/calculator.ts:46:7
     };
   }
 
-  if (section.lines.instrumented === 0) {
+  if (false) {
     return {
       path: filePath,

[NoCoverage] BlockStatement
src/core/coverage/calculator.ts:46:41
     };
   }
 
-  if (section.lines.instrumented === 0) {
-    return {
-      path: filePath,
-      linesCoveragePercentage: 0,
-      branchesCoveragePercentage: 0
-    };
-  }
+  if (section.lines.instrumented === 0) {}
 
   const percentage = (section.lines.hit / section.lines.instrumented) * 100;

[NoCoverage] ObjectLiteral
src/core/coverage/calculator.ts:47:12
   }
 
   if (section.lines.instrumented === 0) {
-    return {
-      path: filePath,
-      linesCoveragePercentage: 0,
-      branchesCoveragePercentage: 0
-    };
+    return {};
   }
 

[Killed] ArithmeticOperator
src/core/coverage/calculator.ts:54:22
     };
   }
 
-  const percentage = (section.lines.hit / section.lines.instrumented) * 100;
+  const percentage = section.lines.hit / section.lines.instrumented / 100;
   const branchesCoveragePercentage = extractBranchCoverage([section]);
 
killedBy: coverage_file_summary tool when all lines in file are covered, then returns 100%
statusReason: expected { path: 'src/main.ts', …(2) } to match object { path: 'src/main.ts', …(1) }
(1 matching property omitted from actual)

[Killed] ArrayDeclaration
src/core/coverage/calculator.ts:55:60
   }
 
   const percentage = (section.lines.hit / section.lines.instrumented) * 100;
-  const branchesCoveragePercentage = extractBranchCoverage([section]);
+  const branchesCoveragePercentage = extractBranchCoverage([]);
 
   return {
killedBy: coverage_file_summary tool when file has both line and branch coverage, then returns both metrics
statusReason: expected { path: 'src/main.ts', …(2) } to match object { path: 'src/main.ts', …(2) }

[Killed] ArithmeticOperator
src/core/coverage/calculator.ts:59:41
 
   return {
     path: filePath,
-    linesCoveragePercentage: Math.round(percentage * 10) / 10,
+    linesCoveragePercentage: Math.round(percentage / 10) / 10,
     branchesCoveragePercentage
   };
killedBy: coverage_file_summary tool when all lines in file are covered, then returns 100%
statusReason: expected { path: 'src/main.ts', …(2) } to match object { path: 'src/main.ts', …(1) }
(1 matching property omitted from actual)

[Killed] ArithmeticOperator
src/core/coverage/calculator.ts:59:30
 
   return {
     path: filePath,
-    linesCoveragePercentage: Math.round(percentage * 10) / 10,
+    linesCoveragePercentage: Math.round(percentage * 10) * 10,
     branchesCoveragePercentage
   };
killedBy: coverage_file_summary tool when all lines in file are covered, then returns 100%
statusReason: expected { path: 'src/main.ts', …(2) } to match object { path: 'src/main.ts', …(1) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/core/coverage/calculator.ts:64:75
   };
 };
 
-export const extractBranchCoverage = (sections: LcovSection[]): number => {
-  if (sections.length === 0) {
-    return 0;
-  }
-
-  let instrumented = 0;
-  let hit = 0;
-
-  for (const section of sections) {
-    if (section.branches) {
-      instrumented += section.branches.instrumented;
-      hit += section.branches.hit;
-    }
-  }
-
-  if (instrumented === 0) {
-    return 0;
-  }
-
-  const percentage = (hit / instrumented) * 100;
-  return Math.round(percentage * 10) / 10;
-};
+export const extractBranchCoverage = (sections: LcovSection[]): number => {};
 
killedBy: coverage_summary tool when file has both line and branch coverage, then returns both metrics; Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: expected undefined to be 75 // Object.is equality

[Killed] EqualityOperator
src/core/coverage/calculator.ts:65:7
 };
 
 export const extractBranchCoverage = (sections: LcovSection[]): number => {
-  if (sections.length === 0) {
+  if (sections.length !== 0) {
     return 0;
   }
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: {"error":"NO_RECORDING_FOUND","message":"No coverage recording found. Please run start_recording first."}

[NoCoverage] BlockStatement
src/core/coverage/calculator.ts:65:30
 };
 
 export const extractBranchCoverage = (sections: LcovSection[]): number => {
-  if (sections.length === 0) {
-    return 0;
-  }
+  if (sections.length === 0) {}
 
   let instrumented = 0;

[Killed] ConditionalExpression
src/core/coverage/calculator.ts:73:9
   let hit = 0;
 
   for (const section of sections) {
-    if (section.branches) {
+    if (true) {
       instrumented += section.branches.instrumented;
       hit += section.branches.hit;
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: {"error":"NO_RECORDING_FOUND","message":"No coverage recording found. Please run start_recording first."}

[Killed] AssignmentOperator
src/core/coverage/calculator.ts:74:7
 
   for (const section of sections) {
     if (section.branches) {
-      instrumented += section.branches.instrumented;
+      instrumented -= section.branches.instrumented;
       hit += section.branches.hit;
     }
killedBy: Coverage diff tracking - get diff since start When coverage improves when branch coverage improves from 50% to 100%, then returns positive branchesPercentageImpact; coverage_summary tool when file has both line and branch coverage, then returns both metrics; coverage_file_summary tool when file has both line and branch coverage, then returns both metrics
statusReason: expected { linesPercentageImpact: +0, …(1) } to match object { linesPercentageImpact: +0, …(1) }

[Killed] EqualityOperator
src/core/coverage/calculator.ts:79:7
     }
   }
 
-  if (instrumented === 0) {
+  if (instrumented !== 0) {
     return 0;
   }
killedBy: coverage_summary tool when file has both line and branch coverage, then returns both metrics; Coverage diff tracking - get diff since start When coverage improves when branch coverage improves from 50% to 100%, then returns positive branchesPercentageImpact
statusReason: expected +0 to be 75 // Object.is equality

[Killed] ArithmeticOperator
src/core/coverage/calculator.ts:84:21
   }
 
   const percentage = (hit / instrumented) * 100;
-  return Math.round(percentage * 10) / 10;
+  return Math.round(percentage / 10) / 10;
 };
 
killedBy: Coverage diff tracking - get diff since start When coverage improves when branch coverage improves from 50% to 100%, then returns positive branchesPercentageImpact; coverage_summary tool when file has both line and branch coverage, then returns both metrics; coverage_file_summary tool when file has both line and branch coverage, then returns both metrics
statusReason: expected { linesPercentageImpact: +0, …(1) } to match object { linesPercentageImpact: +0, …(1) }
