[Killed] BlockStatement
src/core/coverage/parser.ts:7:82
 import { LcovSection } from './types.js';
 import { createError } from '../errors.js';
 
-export const parseLcovFile = async (filePath: string): Promise<LcovSection[]> => {
-  try {
-    const stream = createReadStream(filePath);
-    const parsed = await lcovParser({ from: stream });
-    return parsed as LcovSection[];
-  } catch (error) {
-    if ((error as NodeJS.ErrnoException).code === 'ENOENT') {
-      throw createError('LCOV_FILE_NOT_FOUND', `LCOV file not found: ${filePath}`);
-    }
-    const errorMessage = error instanceof Error ? error.message : String(error);
-    throw createError('LCOV_PARSE_ERROR', `Failed to parse LCOV file: ${filePath}. Error: ${errorMessage}`, error);
-  }
-};
+export const parseLcovFile = async (filePath: string): Promise<LcovSection[]> => {};
 
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%; Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact; coverage_file_summary tool when all lines in file are covered, then returns 100%
statusReason: {"message":"Cannot read properties of undefined (reading 'length')"}

[NoCoverage] BlockStatement
src/core/coverage/parser.ts:12:19
     const stream = createReadStream(filePath);
     const parsed = await lcovParser({ from: stream });
     return parsed as LcovSection[];
-  } catch (error) {
-    if ((error as NodeJS.ErrnoException).code === 'ENOENT') {
-      throw createError('LCOV_FILE_NOT_FOUND', `LCOV file not found: ${filePath}`);
-    }
-    const errorMessage = error instanceof Error ? error.message : String(error);
-    throw createError('LCOV_PARSE_ERROR', `Failed to parse LCOV file: ${filePath}. Error: ${errorMessage}`, error);
-  }
+  } catch (error) {}
 };
 

[NoCoverage] BlockStatement
src/core/coverage/parser.ts:13:61
     const parsed = await lcovParser({ from: stream });
     return parsed as LcovSection[];
   } catch (error) {
-    if ((error as NodeJS.ErrnoException).code === 'ENOENT') {
-      throw createError('LCOV_FILE_NOT_FOUND', `LCOV file not found: ${filePath}`);
-    }
+    if ((error as NodeJS.ErrnoException).code === 'ENOENT') {}
     const errorMessage = error instanceof Error ? error.message : String(error);
     throw createError('LCOV_PARSE_ERROR', `Failed to parse LCOV file: ${filePath}. Error: ${errorMessage}`, error);

[NoCoverage] ConditionalExpression
src/core/coverage/parser.ts:13:9
     const parsed = await lcovParser({ from: stream });
     return parsed as LcovSection[];
   } catch (error) {
-    if ((error as NodeJS.ErrnoException).code === 'ENOENT') {
+    if (true) {
       throw createError('LCOV_FILE_NOT_FOUND', `LCOV file not found: ${filePath}`);
     }

[NoCoverage] StringLiteral
src/core/coverage/parser.ts:17:43
       throw createError('LCOV_FILE_NOT_FOUND', `LCOV file not found: ${filePath}`);
     }
     const errorMessage = error instanceof Error ? error.message : String(error);
-    throw createError('LCOV_PARSE_ERROR', `Failed to parse LCOV file: ${filePath}. Error: ${errorMessage}`, error);
+    throw createError('LCOV_PARSE_ERROR', ``, error);
   }
 };
