[NoCoverage] ObjectLiteral
src/mcp/server.ts:30:65
     }
   );
 
-  server.setRequestHandler(ListToolsRequestSchema, async () => ({
-    tools: [
-      {
-        name: 'coverage_summary',
-        description: TOOL_CONFIGS.coverage_summary.description,
-        inputSchema: zodToJsonSchema(CoverageSummaryInputSchema),
-      },
-      {
-        name: 'coverage_file_summary',
-        description: TOOL_CONFIGS.coverage_file_summary.description,
-        inputSchema: zodToJsonSchema(CoverageFileSummaryInputSchema),
-      },
-      {
-        name: 'start_recording',
-        description: TOOL_CONFIGS.start_recording.description,
-        inputSchema: zodToJsonSchema(StartRecordingInputSchema),
-      },
-      {
-        name: 'get_diff_since_start',
-        description: TOOL_CONFIGS.get_diff_since_start.description,
-        inputSchema: zodToJsonSchema(GetDiffSinceStartInputSchema),
-      },
-    ],
-  }));
+  server.setRequestHandler(ListToolsRequestSchema, async () => ({}));
 
   server.setRequestHandler(CallToolRequestSchema, async (request) => {

[NoCoverage] StringLiteral
src/mcp/server.ts:38:15
         inputSchema: zodToJsonSchema(CoverageSummaryInputSchema),
       },
       {
-        name: 'coverage_file_summary',
+        name: "",
         description: TOOL_CONFIGS.coverage_file_summary.description,
         inputSchema: zodToJsonSchema(CoverageFileSummaryInputSchema),

[NoCoverage] StringLiteral
src/mcp/server.ts:43:15
         inputSchema: zodToJsonSchema(CoverageFileSummaryInputSchema),
       },
       {
-        name: 'start_recording',
+        name: "",
         description: TOOL_CONFIGS.start_recording.description,
         inputSchema: zodToJsonSchema(StartRecordingInputSchema),

[NoCoverage] StringLiteral
src/mcp/server.ts:48:15
         inputSchema: zodToJsonSchema(StartRecordingInputSchema),
       },
       {
-        name: 'get_diff_since_start',
+        name: "",
         description: TOOL_CONFIGS.get_diff_since_start.description,
         inputSchema: zodToJsonSchema(GetDiffSinceStartInputSchema),

[Killed] BlockStatement
src/mcp/server.ts:55:70
     ],
   }));
 
-  server.setRequestHandler(CallToolRequestSchema, async (request) => {
-    if (request.params.name === 'coverage_summary') {
-      const validatedInput = CoverageSummaryInputSchema.parse(request.params.arguments);
-      return handleCoverageSummary(validatedInput);
-    }
-
-    if (request.params.name === 'coverage_file_summary') {
-      const validatedInput = CoverageFileSummaryInputSchema.parse(request.params.arguments);
-      return handleFileCoverageSummary(validatedInput);
-    }
-
-    if (request.params.name === 'start_recording') {
-      const validatedInput = StartRecordingInputSchema.parse(request.params.arguments);
-      return handleStartRecording(validatedInput);
-    }
-
-    if (request.params.name === 'get_diff_since_start') {
-      const validatedInput = GetDiffSinceStartInputSchema.parse(request.params.arguments);
-      return handleGetDiffSinceStart(validatedInput);
-    }
-
-    throw new Error(`Unknown tool: ${request.params.name}`);
-  });
+  server.setRequestHandler(CallToolRequestSchema, async (request) => {});
 
   return server;
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%; coverage_file_summary tool when all lines in file are covered, then returns 100%; Coverage diff tracking - start recording When recording successfully when recording baseline for the first time, then returns success message
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ConditionalExpression
src/mcp/server.ts:56:9
   }));
 
   server.setRequestHandler(CallToolRequestSchema, async (request) => {
-    if (request.params.name === 'coverage_summary') {
+    if (false) {
       const validatedInput = CoverageSummaryInputSchema.parse(request.params.arguments);
       return handleCoverageSummary(validatedInput);
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%
statusReason: MCP error -32603: Unknown tool: coverage_summary

[Killed] BlockStatement
src/mcp/server.ts:56:53
   }));
 
   server.setRequestHandler(CallToolRequestSchema, async (request) => {
-    if (request.params.name === 'coverage_summary') {
-      const validatedInput = CoverageSummaryInputSchema.parse(request.params.arguments);
-      return handleCoverageSummary(validatedInput);
-    }
+    if (request.params.name === 'coverage_summary') {}
 
     if (request.params.name === 'coverage_file_summary') {
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%
statusReason: MCP error -32603: Unknown tool: coverage_summary

[Killed] ConditionalExpression
src/mcp/server.ts:61:9
       return handleCoverageSummary(validatedInput);
     }
 
-    if (request.params.name === 'coverage_file_summary') {
+    if (false) {
       const validatedInput = CoverageFileSummaryInputSchema.parse(request.params.arguments);
       return handleFileCoverageSummary(validatedInput);
killedBy: coverage_file_summary tool when all lines in file are covered, then returns 100%
statusReason: MCP error -32603: Unknown tool: coverage_file_summary

[Killed] EqualityOperator
src/mcp/server.ts:61:9
       return handleCoverageSummary(validatedInput);
     }
 
-    if (request.params.name === 'coverage_file_summary') {
+    if (request.params.name !== 'coverage_file_summary') {
       const validatedInput = CoverageFileSummaryInputSchema.parse(request.params.arguments);
       return handleFileCoverageSummary(validatedInput);
killedBy: Coverage diff tracking - start recording When recording successfully when recording baseline for the first time, then returns success message; coverage_file_summary tool when all lines in file are covered, then returns 100%
statusReason: MCP error -32603: [
  {
    "code": "invalid_type",
    "expected": "string",
    "received": "undefined",
    "path": [
      "filePath"
    ],

[Killed] ConditionalExpression
src/mcp/server.ts:66:9
       return handleFileCoverageSummary(validatedInput);
     }
 
-    if (request.params.name === 'start_recording') {
+    if (false) {
       const validatedInput = StartRecordingInputSchema.parse(request.params.arguments);
       return handleStartRecording(validatedInput);
killedBy: Coverage diff tracking - start recording When recording successfully when recording baseline for the first time, then returns success message
statusReason: MCP error -32603: Unknown tool: start_recording

[Killed] StringLiteral
src/mcp/server.ts:66:33
       return handleFileCoverageSummary(validatedInput);
     }
 
-    if (request.params.name === 'start_recording') {
+    if (request.params.name === "") {
       const validatedInput = StartRecordingInputSchema.parse(request.params.arguments);
       return handleStartRecording(validatedInput);
killedBy: Coverage diff tracking - start recording When recording successfully when recording baseline for the first time, then returns success message
statusReason: MCP error -32603: Unknown tool: start_recording

[Killed] EqualityOperator
src/mcp/server.ts:71:9
       return handleStartRecording(validatedInput);
     }
 
-    if (request.params.name === 'get_diff_since_start') {
+    if (request.params.name !== 'get_diff_since_start') {
       const validatedInput = GetDiffSinceStartInputSchema.parse(request.params.arguments);
       return handleGetDiffSinceStart(validatedInput);
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: MCP error -32603: Unknown tool: get_diff_since_start

[Killed] BlockStatement
src/mcp/server.ts:71:57
       return handleStartRecording(validatedInput);
     }
 
-    if (request.params.name === 'get_diff_since_start') {
-      const validatedInput = GetDiffSinceStartInputSchema.parse(request.params.arguments);
-      return handleGetDiffSinceStart(validatedInput);
-    }
+    if (request.params.name === 'get_diff_since_start') {}
 
     throw new Error(`Unknown tool: ${request.params.name}`);
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: MCP error -32603: Unknown tool: get_diff_since_start

[NoCoverage] BlockStatement
src/mcp/server.ts:82:69
   return server;
 };
 
-export const startServer = async (server: Server): Promise<void> => {
-  const transport = new StdioServerTransport();
-  await server.connect(transport);
-
-  console.error('[Coverage MCP] Server started successfully');
-};
+export const startServer = async (server: Server): Promise<void> => {};
 
