[Killed] ArithmeticOperator
src/core/coverage/diff-calculator.ts:44:5
   );
 
   const linesPercentageImpact =
-    currentCoverage.linesCoveragePercentage -
-    baselineCoverage.linesCoveragePercentage;
+    currentCoverage.linesCoveragePercentage + baselineCoverage.linesCoveragePercentage;
   const branchesPercentageImpact =
     currentCoverage.branchesCoveragePercentage - baselineCoverage.branchesCoveragePercentage;
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: expected { linesPercentageImpact: 150, …(1) } to match object { linesPercentageImpact: 50, …(1) }

[Survived] StringLiteral
src/core/coverage/diff-calculator.ts:50:5
     currentCoverage.branchesCoveragePercentage - baselineCoverage.branchesCoveragePercentage;
 
   console.error(
-    "Diff calculator: Calculated impact",
+    "",
     linesPercentageImpact,
     branchesPercentageImpact

[Killed] ArithmeticOperator
src/core/coverage/diff-calculator.ts:55:39
     branchesPercentageImpact
   );
   return {
-    linesPercentageImpact: Math.round(linesPercentageImpact * 100) / 100,
+    linesPercentageImpact: Math.round(linesPercentageImpact / 100) / 100,
     branchesPercentageImpact: Math.round(branchesPercentageImpact * 100) / 100,
   };
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: expected { linesPercentageImpact: 0.01, …(1) } to match object { linesPercentageImpact: 50, …(1) }

[Killed] ArithmeticOperator
src/core/coverage/diff-calculator.ts:56:42
   );
   return {
     linesPercentageImpact: Math.round(linesPercentageImpact * 100) / 100,
-    branchesPercentageImpact: Math.round(branchesPercentageImpact * 100) / 100,
+    branchesPercentageImpact: Math.round(branchesPercentageImpact / 100) / 100,
   };
 };
killedBy: Coverage diff tracking - get diff since start When coverage improves when branch coverage improves from 50% to 100%, then returns positive branchesPercentageImpact
statusReason: expected { linesPercentageImpact: +0, …(1) } to match object { linesPercentageImpact: +0, …(1) }
