[Killed] BlockStatement
src/core/coverage/facade.ts:13:29
 
 export const getOverallCoverageSummary = async (
   lcovPath?: string
-): Promise<CoverageInfo> => {
-  const resolvedPath = await resolveLcovPath(lcovPath);
-  const sections = await parseLcovFile(resolvedPath);
-  return calculateOverallCoverage(sections);
-};
+): Promise<CoverageInfo> => {};
 
 export const getFileCoverageSummary = async (
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%
statusReason: [
  {
    "code": "invalid_union",
    "unionErrors": [
      {
        "issues": [
          {
            "code": "invalid_type",

[Killed] BlockStatement
src/core/coverage/facade.ts:30:21
 
 export const startCoverageRecording = async (
   lcovPath: string
-): Promise<void> => {
-  await recordBaseline(lcovPath);
-};
+): Promise<void> => {};
 
 export const getCoverageDiffSinceStart = async (
killedBy: Coverage diff tracking - start recording When recording fails when lcov file does not exist, then returns LCOV_FILE_NOT_FOUND error
statusReason: Expected tool to return error, but it succeeded
