[Killed] BlockStatement
src/mcp/handlers.ts:16:7
 } from "../core/coverage/facade.js";
 
 export const handleCoverageSummary = async (input: CoverageSummaryInput) => {
-  try {
-    const coverage = await getOverallCoverageSummary(input.lcovPath);
-    return {
-      content: [{ type: "text" as const, text: JSON.stringify(coverage) }],
-    };
-  } catch (error) {
+  try {} catch (error) {
     const coverageError = error as CoverageError;
     return {
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BlockStatement
src/mcp/handlers.ts:21:19
     return {
       content: [{ type: "text" as const, text: JSON.stringify(coverage) }],
     };
-  } catch (error) {
-    const coverageError = error as CoverageError;
-    return {
-      content: [
-        {
-          type: "text" as const,
-          text: JSON.stringify({
-            error: coverageError.code,
-            message: coverageError.message,
-          }),
-        },
-      ],
-      isError: true,
-    };
-  }
+  } catch (error) {}
 };
 
killedBy: coverage_summary tool when lcov path does not exist, then returns error
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] BooleanLiteral
src/mcp/handlers.ts:33:16
           }),
         },
       ],
-      isError: true,
+      isError: false,
     };
   }
killedBy: coverage_summary tool when lcov path does not exist, then returns error
statusReason: Expected tool to return error, but it succeeded

[Killed] ObjectLiteral
src/mcp/handlers.ts:51:12
     };
   } catch (error) {
     const coverageError = error as CoverageError;
-    return {
-      content: [
-        {
-          type: "text" as const,
-          text: JSON.stringify({
-            error: coverageError.code,
-            message: coverageError.message,
-          }),
-        },
-      ],
-      isError: true,
-    };
+    return {};
   }
 };
killedBy: coverage_file_summary tool when lcov path does not exist, then returns error
statusReason: Expected tool to return error, but it succeeded

[Killed] BlockStatement
src/mcp/handlers.ts:67:7
 };
 
 export const handleStartRecording = async (input: StartRecordingInput) => {
-  try {
-    console.error("Tool handler: Starting recording", input.lcovPath);
-    await startCoverageRecording(input.lcovPath);
-    return {
-      content: [{ type: "text" as const, text: '"Recording started"' }],
-    };
-  } catch (error) {
+  try {} catch (error) {
     const coverageError = error as CoverageError;
     return {
killedBy: Coverage diff tracking - start recording When recording successfully when recording baseline for the first time, then returns success message
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Killed] ObjectLiteral
src/mcp/handlers.ts:71:17
     console.error("Tool handler: Starting recording", input.lcovPath);
     await startCoverageRecording(input.lcovPath);
     return {
-      content: [{ type: "text" as const, text: '"Recording started"' }],
+      content: [{}],
     };
   } catch (error) {
killedBy: Coverage diff tracking - start recording When recording successfully when recording baseline for the first time, then returns success message
statusReason: [
  {
    "code": "invalid_union",
    "unionErrors": [
      {
        "issues": [
          {
            "code": "invalid_literal",

[Killed] ArrayDeclaration
src/mcp/handlers.ts:76:16
   } catch (error) {
     const coverageError = error as CoverageError;
     return {
-      content: [
-        {
-          type: "text" as const,
-          text: JSON.stringify({
-            error: coverageError.code,
-            message: coverageError.message,
-          }),
-        },
-      ],
+      content: [],
       isError: true,
     };
killedBy: Coverage diff tracking - start recording When recording fails when lcov file does not exist, then returns LCOV_FILE_NOT_FOUND error
statusReason: expected { isError: true, …(3) } to match object { isError: true, …(2) }
(1 matching property omitted from actual)

[Killed] BlockStatement
src/mcp/handlers.ts:92:6
 
 export const handleGetDiffSinceStart = async (
   input: GetDiffSinceStartInput
-) => {
-  console.error("Tool handler: Getting diff", input.lcovPath);
-  try {
-    const diff = await getCoverageDiffSinceStart(input.lcovPath);
-    return {
-      content: [{ type: "text" as const, text: JSON.stringify(diff) }],
-    };
-  } catch (error) {
-    const coverageError = error as CoverageError;
-    return {
-      content: [
-        {
-          type: "text" as const,
-          text: JSON.stringify({
-            error: coverageError.code,
-            message: coverageError.message,
-          }),
-        },
-      ],
-      isError: true,
-    };
-  }
-};
+) => {};
 
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".

[Survived] StringLiteral
src/mcp/handlers.ts:93:17
 export const handleGetDiffSinceStart = async (
   input: GetDiffSinceStartInput
 ) => {
-  console.error("Tool handler: Getting diff", input.lcovPath);
+  console.error("", input.lcovPath);
   try {
     const diff = await getCoverageDiffSinceStart(input.lcovPath);

[Killed] BlockStatement
src/mcp/handlers.ts:94:7
   input: GetDiffSinceStartInput
 ) => {
   console.error("Tool handler: Getting diff", input.lcovPath);
-  try {
-    const diff = await getCoverageDiffSinceStart(input.lcovPath);
-    return {
-      content: [{ type: "text" as const, text: JSON.stringify(diff) }],
-    };
-  } catch (error) {
+  try {} catch (error) {
     const coverageError = error as CoverageError;
     return {
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: Test timed out in 5000ms.
If this is a long-running test, pass a timeout value as the last argument or configure it globally with "testTimeout".
