[Killed] BlockStatement
src/core/errors.ts:13:76
   code: CoverageErrorCode;
   details?: unknown;
 
-  constructor(code: CoverageErrorCode, message: string, details?: unknown) {
-    super(message);
-    this.name = 'CoverageError';
-    this.code = code;
-    this.details = details;
-  }
+  constructor(code: CoverageErrorCode, message: string, details?: unknown) {}
 }
 
killedBy: Coverage diff tracking - start recording When recording fails when lcov file does not exist, then returns LCOV_FILE_NOT_FOUND error; coverage_summary tool when lcov path does not exist, then returns error; coverage_file_summary tool when lcov path does not exist, then returns error
statusReason: expected { isError: true, …(3) } to match object { isError: true, …(2) }
(1 matching property omitted from actual)
