[Killed] ObjectLiteral
src/schemas/tool-schemas.ts:17:52
 /**
  * Schema for coverage_summary tool input
  */
-export const CoverageSummaryInputSchema = z.object({
-  lcovPath: z
-    .string()
-    .optional()
-    .describe('Path to the LCOV coverage file. Can be absolute or relative. Defaults to ./coverage/lcov.info')
-});
+export const CoverageSummaryInputSchema = z.object({});
 
 /**
killedBy: coverage_summary tool when all lines in 2 files are covered, then returns 100%
statusReason: expected 89.8 to be 100 // Object.is equality

[Killed] MethodExpression
src/schemas/tool-schemas.ts:45:28
  * Schema for coverage_summary tool response (overall coverage only)
  */
 export const CoverageSummaryResponseSchema = z.object({
-  linesCoveragePercentage: z
-    .number()
-    .min(0)
-    .max(100)
+  linesCoveragePercentage: z.number().min(0).min(100)
     .describe('Line coverage percentage (0-100)'),
   branchesCoveragePercentage: z
killedBy: Coverage diff tracking - get diff since start When coverage improves when both line and branch coverage improve, then returns positive impact for both
statusReason: {"error":"NO_RECORDING_FOUND","message":"No coverage recording found. Please run start_recording first."}

[Survived] StringLiteral
src/schemas/tool-schemas.ts:49:15
     .number()
     .min(0)
     .max(100)
-    .describe('Line coverage percentage (0-100)'),
+    .describe(""),
   branchesCoveragePercentage: z
     .number()

[Killed] MethodExpression
src/schemas/tool-schemas.ts:50:31
     .min(0)
     .max(100)
     .describe('Line coverage percentage (0-100)'),
-  branchesCoveragePercentage: z
-    .number()
-    .min(0)
+  branchesCoveragePercentage: z.number().max(0)
     .max(100)
     .describe('Branch coverage percentage (0-100). Returns 0 if no branch data.')
killedBy: Coverage diff tracking - get diff since start When coverage decreases when line coverage decreases from 75% to 50%, then returns negative linesPercentageImpact
statusReason: {"error":"NO_RECORDING_FOUND","message":"No coverage recording found. Please run start_recording first."}

[Killed] MethodExpression
src/schemas/tool-schemas.ts:62:28
  */
 export const CoverageFileSummaryResponseSchema = z.object({
   path: z.string().describe('File path'),
-  linesCoveragePercentage: z
-    .number()
-    .min(0)
+  linesCoveragePercentage: z.number().max(0)
     .max(100)
     .describe('Line coverage percentage (0-100)'),
killedBy: Coverage diff tracking - get diff since start When coverage improves when line coverage improves from 50% to 100%, then returns positive linesPercentageImpact
statusReason: {"error":"NO_RECORDING_FOUND","message":"No coverage recording found. Please run start_recording first."}
